"""Головний файл для запуску Лабораторної роботи №1."""

from task1 import analyze_passwords
from task2 import check_access
from task3 import run_task3


def main():
    """Точка входу для запуску всіх завдань."""
    print("=========================================")
    print("Початок виконання Лабораторної роботи №1")
    print("=========================================")

    # Виклик Завдання 1
    analyze_passwords()

    # Виклик Завдання 2
    check_access()

    # Виклик Завдання 3
    run_task3()

    print("\n=========================================")
    print("Виконання лабораторної роботи завершено.")
    print("=========================================")


if __name__ == "__main__":
    main()
